In [2]:
# Importar la librería principal
import pandas as pd

# Configuración opcional para que las tablas se vean mejor
pd.set_option("display.max_rows", 10)   # máximo de filas visibles
pd.set_option("display.max_columns", None)  # mostrar todas las columnas

print("✅ Pandas cargado correctamente")

✅ Pandas cargado correctamente

In [5]:
df = pd.read_csv ("empleados.csv")

In [6]:
df.head()

   id  nombre  edad      departamento  salario
0   1     Ana    28         Marketing     2500
1   2    Luis    34                IT     3200
2   3   Marta    29  Recursos Humanos     2700
3   4  Carlos    40          Finanzas     4000
4   5   Sofía    25         Marketing     2200

In [7]:
df

   id  nombre  edad      departamento  salario
0   1     Ana    28         Marketing     2500
1   2    Luis    34                IT     3200
2   3   Marta    29  Recursos Humanos     2700
3   4  Carlos    40          Finanzas     4000
4   5   Sofía    25         Marketing     2200
5   6   Pedro    38                IT     3500
6   7   Laura    31          Finanzas     3100

In [8]:
df.shape

(7, 5)

In [9]:
df.info

<bound method DataFrame.info of    id  nombre  edad      departamento  salario
0   1     Ana    28         Marketing     2500
1   2    Luis    34                IT     3200
2   3   Marta    29  Recursos Humanos     2700
3   4  Carlos    40          Finanzas     4000
4   5   Sofía    25         Marketing     2200
5   6   Pedro    38                IT     3500
6   7   Laura    31          Finanzas     3100>

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            7 non-null      int64
 1   nombre        7 non-null      object
 2   edad          7 non-null      int64
 3   departamento  7 non-null      object
 4   salario       7 non-null      int64
dtypes: int64(3), object(2)
memory usage: 412.0+ bytes

In [11]:
df.dtypes

id               int64
nombre          object
edad             int64
departamento    object
salario          int64
dtype: object

In [13]:
df["nombre"]

0       Ana
1      Luis
2     Marta
3    Carlos
4     Sofía
5     Pedro
6     Laura
Name: nombre, dtype: object

In [14]:
df[["nombre","salario"]]

   nombre  salario
0     Ana     2500
1    Luis     3200
2   Marta     2700
3  Carlos     4000
4   Sofía     2200
5   Pedro     3500
6   Laura     3100

In [15]:
df.loc[0]

id                      1
nombre                Ana
edad                   28
departamento    Marketing
salario              2500
Name: 0, dtype: object

In [16]:
df.loc[1]

id                 2
nombre          Luis
edad              34
departamento      IT
salario         3200
Name: 1, dtype: object

In [17]:
df.iloc[1]

id                 2
nombre          Luis
edad              34
departamento      IT
salario         3200
Name: 1, dtype: object

In [18]:
df.iloc[0,3]

'Marketing'

In [19]:
df.iloc[0:3]

   id nombre  edad      departamento  salario
0   1    Ana    28         Marketing     2500
1   2   Luis    34                IT     3200
2   3  Marta    29  Recursos Humanos     2700

In [20]:
df.loc[2, "salario"]

np.int64(2700)

In [21]:
print(df)

   id  nombre  edad      departamento  salario
0   1     Ana    28         Marketing     2500
1   2    Luis    34                IT     3200
2   3   Marta    29  Recursos Humanos     2700
3   4  Carlos    40          Finanzas     4000
4   5   Sofía    25         Marketing     2200
5   6   Pedro    38                IT     3500
6   7   Laura    31          Finanzas     3100

In [22]:
df = pd.read_csv("empleados.csv")

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            7 non-null      object
 1   nombre        7 non-null      object
 2   edad          7 non-null      int64
 3   departamento  7 non-null      object
 4   salario       7 non-null      int64
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [24]:
df.info

<bound method DataFrame.info of        id  nombre  edad      departamento  salario
0  EMP001     Ana    28         Marketing     2500
1  EMP002    Luis    34                IT     3200
2  EMP003   Marta    29  Recursos Humanos     2700
3  EMP004  Carlos    40          Finanzas     4000
4  EMP005   Sofía    25         Marketing     2200
5  EMP006   Pedro    38                IT     3500
6  EMP007   Laura    31          Finanzas     3100>

In [25]:
print(df)

       id  nombre  edad      departamento  salario
0  EMP001     Ana    28         Marketing     2500
1  EMP002    Luis    34                IT     3200
2  EMP003   Marta    29  Recursos Humanos     2700
3  EMP004  Carlos    40          Finanzas     4000
4  EMP005   Sofía    25         Marketing     2200
5  EMP006   Pedro    38                IT     3500
6  EMP007   Laura    31          Finanzas     3100

In [26]:
df.iloc[1]

id              EMP002
nombre            Luis
edad                34
departamento        IT
salario           3200
Name: 1, dtype: object

In [27]:
df.loc[2]

id                        EMP003
nombre                     Marta
edad                          29
departamento    Recursos Humanos
salario                     2700
Name: 2, dtype: object

In [28]:
df.iloc[2]

id                        EMP003
nombre                     Marta
edad                          29
departamento    Recursos Humanos
salario                     2700
Name: 2, dtype: object

In [29]:
print(df)

       id  nombre  edad      departamento  salario
0  EMP001     Ana    28         Marketing     2500
1  EMP002    Luis    34                IT     3200
2  EMP003   Marta    29  Recursos Humanos     2700
3  EMP004  Carlos    40          Finanzas     4000
4  EMP005   Sofía    25         Marketing     2200
5  EMP006   Pedro    38                IT     3500
6  EMP007   Laura    31          Finanzas     3100

In [31]:
df.iloc[1]

id              EMP002
nombre            Luis
edad                34
departamento        IT
salario           3200
Name: 1, dtype: object

In [33]:
df.loc[1]

id              EMP002
nombre            Luis
edad                34
departamento        IT
salario           3200
Name: 1, dtype: object

In [34]:
df["nombre"]

0       Ana
1      Luis
2     Marta
3    Carlos
4     Sofía
5     Pedro
6     Laura
Name: nombre, dtype: object

In [35]:
df[["nombre", "salario"]]

   nombre  salario
0     Ana     2500
1    Luis     3200
2   Marta     2700
3  Carlos     4000
4   Sofía     2200
5   Pedro     3500
6   Laura     3100

In [36]:
df[df["salario"] > 3000]

       id  nombre  edad departamento  salario
1  EMP002    Luis    34           IT     3200
3  EMP004  Carlos    40     Finanzas     4000
5  EMP006   Pedro    38           IT     3500
6  EMP007   Laura    31     Finanzas     3100

In [37]:
df[df["departamento"] == "IT"]

       id nombre  edad departamento  salario
1  EMP002   Luis    34           IT     3200
5  EMP006  Pedro    38           IT     3500

In [38]:
df[(df["departamento"] == "IT") & (df["salario"] > 3000)]

       id nombre  edad departamento  salario
1  EMP002   Luis    34           IT     3200
5  EMP006  Pedro    38           IT     3500

In [39]:
df["salario"].mean()

np.float64(3028.5714285714284)

In [40]:
df["salario"].max()

np.int64(4000)

In [41]:
df["salario"].min()

np.int64(2200)

In [42]:
df["edad"].mean()

np.float64(32.142857142857146)

In [43]:
df.groupby("departamento")["salario"].mean()

departamento
Finanzas            3550.0
IT                  3350.0
Marketing           2350.0
Recursos Humanos    2700.0
Name: salario, dtype: float64

In [44]:
df.groupby("departamento")["edad"].mean()

departamento
Finanzas            35.5
IT                  36.0
Marketing           26.5
Recursos Humanos    29.0
Name: edad, dtype: float64

In [46]:
df.groupby("departamento")[["salario","edad"]].mean()

                  salario  edad
departamento
Finanzas           3550.0  35.5
IT                 3350.0  36.0
Marketing          2350.0  26.5
Recursos Humanos   2700.0  29.0